MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX570F512H.PIC
      <edc:SFRDef edc:_addr="0x1F886660" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-02495_TRAN_Ports.Module" edc:_refcount="6" edc:access="----------------------nnnn--nn--" edc:cname="CNPDG" edc:desc="" edc:grp="PORTG" edc:impl="0xffff03cc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------xxxx--xx--" edc:name="CNPDG" edc:nzwidth="0x20" edc:por="----------------------xxxx--xx--" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDG2" edc:desc="" edc:mask="0x1" edc:name="CNPDG2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDG3" edc:desc="" edc:mask="0x1" edc:name="CNPDG3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDG6" edc:desc="" edc:mask="0x1" edc:name="CNPDG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDG7" edc:desc="" edc:mask="0x1" edc:name="CNPDG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDG8" edc:desc="" edc:mask="0x1" edc:name="CNPDG8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDG9" edc:desc="" edc:mask="0x1" edc:name="CNPDG9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886670" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-02495_TRAN_Ports.Module" edc:_refcount="6" edc:access="----------------n-n-------------" edc:cname="CNCONG" edc:desc="" edc:grp="PORTG" edc:impl="0xffffbfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000-00000000000000" edc:name="CNCONG" edc:nzwidth="0x20" edc:por="00000000000000000-00000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="13"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886680" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-02495_TRAN_Ports.Module" edc:_refcount="6" edc:access="----------------------nnnn--nn--" edc:cname="CNENG" edc:desc="" edc:grp="PORTG" edc:impl="0xffc003cc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000------------xxxx--xx--" edc:name="CNENG" edc:nzwidth="0x20" edc:por="0000000000------------xxxx--xx--" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIEG2" edc:desc="" edc:mask="0x1" edc:name="CNIEG2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEG3" edc:desc="" edc:mask="0x1" edc:name="CNIEG3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIEG6" edc:desc="" edc:mask="0x1" edc:name="CNIEG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEG7" edc:desc="" edc:mask="0x1" edc:name="CNIEG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEG8" edc:desc="" edc:mask="0x1" edc:name="CNIEG8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEG9" edc:desc="" edc:mask="0x1" edc:name="CNIEG9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886690" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-02495_TRAN_Ports.Module" edc:_refcount="6" edc:access="----------------------nnnn--nn--" edc:cname="CNSTATG" edc:desc="" edc:grp="PORTG" edc:impl="0xffff03cc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------xxxx--xx--" edc:name="CNSTATG" edc:nzwidth="0x20" edc:por="----------------------xxxx--xx--" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG2" edc:desc="" edc:mask="0x1" edc:name="CNSTATG2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG3" edc:desc="" edc:mask="0x1" edc:name="CNSTATG3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG6" edc:desc="" edc:mask="0x1" edc:name="CNSTATG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG7" edc:desc="" edc:mask="0x1" edc:name="CNSTATG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG8" edc:desc="" edc:mask="0x1" edc:name="CNSTATG8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATG9" edc:desc="" edc:mask="0x1" edc:name="CNSTATG9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
